import 'package:sakina_app/features/azkar/data/models/zekr_model.dart';

abstract class AzkarData {
  static List<ZekrModel> morningEveningAzkar = [
    ZekrModel(
      count: 1,
      zekr: 'الحمد لله وحده ، والصلاة والسلام على من لا نبي بعده',
      type1: 'أبو داود 3667',
      type2: 'فضل الاجتماع على الذكر',
    ),

    ZekrModel(
      count: 1,
      zekr:
          'اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ ... (آية الكرسي كاملة)',
      type1: 'سورة البقرة 255',
      type2: 'من قالها حين يمسي أجير منهم حتى يصبح',
    ),

    ZekrModel(
      count: 3,
      zekr:
          'قل هو الله أحد ، قل أعوذ برب الفلق ، قل أعوذ برب الناس (ثلاث مرات)',
      type1: 'أبو داود والترمذي',
      type2: 'تكفيه من كل شيء',
    ),

    ZekrModel(
      count: 1,
      zekr:
          'أصبحنا وأصبح الملك لله والحمد لله لا إله إلا الله وحده لا شريك له...',
      type1: 'مسلم 4/2088',
      type2: 'طلب خير اليوم والاستعاذة من شره',
    ),

    ZekrModel(
      count: 1,
      zekr: 'اللهم بك أصبحنا وبك أمسينا وبك نحيا وبك نموت وإليك النشور',
      type1: 'الترمذي 5/466',
      type2: 'تفويض الأمر لله',
    ),

    ZekrModel(
      count: 1,
      zekr: 'اللهم أنت ربي لا إله إلا أنت خلقتني وأنا عبدك...',
      type1: 'البخاري 7/150',
      type2: 'من قالها موقناً بها دخل الجنة',
    ),

    ZekrModel(
      count: 4,
      zekr: 'اللهم إني أصبحت أشهدك وأشهد حملة عرشك...',
      type1: 'أبو داود 4/317',
      type2: 'من قالها أربع مرات أعتقه الله من النار',
    ),

    ZekrModel(
      count: 1,
      zekr: 'اللهم ما أصبح بي من نعمة أو بأحد من خلقك فمنك وحدك...',
      type1: 'أبو داود 4/318',
      type2: 'أدى شكر يومه',
    ),

    ZekrModel(
      count: 3,
      zekr: 'اللهم عافني في بدني، اللهم عافني في سمعي...',
      type1: 'أبو داود 4/324',
      type2: 'طلب العافية',
    ),

    ZekrModel(
      count: 7,
      zekr: 'حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم',
      type1: 'ابن السني 71',
      type2: 'كفاه الله ما أهمه',
    ),

    ZekrModel(
      count: 100,
      zekr: 'سُبْحَانَ اللَّهِ وَبِحَمْدِهِ',
      type1: 'مسلم 4/2071',
      type2: 'تُحَطّ خطاياه وإن كانت مثل زبد البحر',
    ),

    ZekrModel(
      count: 100,
      zekr:
          'لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير',
      type1: 'البخاري 4/95',
      type2: 'كانت له عدل عشر رقاب وحرز من الشيطان',
    ),
  ];

  static List<ZekrModel> adhanAzkar = [
    ZekrModel(
      count: 1,
      zekr:
          'يقول مثل ما يقول المؤذن إلا في حي على الصلاة وحي على الفلاح فيقول لا حول ولا قوة إلا بالله',
      type1: 'البخاري 1/152',
      type2: 'فضل إجابة المؤذن',
    ),

    ZekrModel(
      count: 1,
      zekr:
          'اللهم رب هذه الدعوة التامة والصلاة القائمة آت محمداً الوسيلة والفضيلة...',
      type1: 'البخاري 1/152',
      type2: 'حلت له شفاعة النبي ﷺ',
    ),
  ];

  static List<ZekrModel> afterPrayerAzkar = [
    ZekrModel(
      count: 3,
      zekr: 'أستغفر الله',
      type1: 'مسلم 1/414',
      type2: 'مغفرة التقصير بعد الصلاة',
    ),

    ZekrModel(
      count: 33,
      zekr: 'سبحان الله',
      type1: 'مسلم 1/418',
      type2: 'مغفرة الذنوب',
    ),

    ZekrModel(
      count: 33,
      zekr: 'الحمد لله',
      type1: 'مسلم 1/418',
      type2: 'مغفرة الذنوب',
    ),

    ZekrModel(
      count: 34,
      zekr: 'الله أكبر',
      type1: 'مسلم 1/418',
      type2: 'مغفرة الذنوب',
    ),
  ];

  static List<ZekrModel> sleepAzkar = [
    ZekrModel(
      count: 1,
      zekr: 'الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور',
      type1: 'البخاري 11/113',
      type2: 'شكر الله على نعمة الحياة بعد النوم',
    ),

    ZekrModel(
      count: 1,
      zekr: 'الحمد لله الذي عافاني في جسدي ورد علي روحي وأذن لي بذكره',
      type1: 'الترمذي 5/473',
      type2: 'شكر نعمة العافية',
    ),

    ZekrModel(
      count: 1,
      zekr:
          'لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير... ثم دعا: اللهم اغفر لي',
      type1: 'البخاري',
      type2: 'يغفر له وتستجاب دعوته',
    ),
  ];

  static List<ZekrModel> homeAzkar = [
    ZekrModel(
      count: 1,
      zekr: 'بسم الله ، توكلت على الله ، ولا حول ولا قوة إلا بالله',
      type1: 'أبو داود والترمذي',
      type2: 'كُفيت ووقيت وهديت وتنحى عنه الشيطان',
    ),

    ZekrModel(
      count: 1,
      zekr: 'بسم الله ولجنا وبسم الله خرجنا وعلى ربنا توكلنا',
      type1: 'أبو داود 4/325',
      type2: 'منع الشيطان من المبيت',
    ),
  ];

  static List<ZekrModel> mosqueAzkar = [
    ZekrModel(
      count: 1,
      zekr: 'أعوذ بالله العظيم وبوجهه الكريم وسلطانه القديم من الشيطان الرجيم',
      type1: 'أبو داود',
      type2: 'حفظ من الشيطان',
    ),

    ZekrModel(
      count: 1,
      zekr: 'اللهم افتح لي أبواب رحمتك',
      type1: 'مسلم 1/494',
      type2: 'طلب الرحمة عند دخول المسجد',
    ),

    ZekrModel(
      count: 1,
      zekr: 'اللهم إني أسألك من فضلك',
      type1: 'مسلم',
      type2: 'طلب الرزق عند الخروج من المسجد',
    ),
  ];

  static List<ZekrModel> wuduAzkar = [
    ZekrModel(
      count: 1,
      zekr: 'بسم الله',
      type1: 'أبو داود',
      type2: 'ذكر اسم الله قبل الوضوء',
    ),

    ZekrModel(
      count: 1,
      zekr:
          'أشهد أن لا إله إلا الله وحده لا شريك له وأشهد أن محمداً عبده ورسوله',
      type1: 'مسلم 1/209',
      type2: 'فتحت له أبواب الجنة الثمانية',
    ),

    ZekrModel(
      count: 1,
      zekr: 'اللهم اجعلني من التوابين واجعلني من المتطهرين',
      type1: 'الترمذي 1/78',
      type2: 'طلب الطهارة المعنوية',
    ),
  ];

  static List<ZekrModel> bathroomAzkar = [
    ZekrModel(
      count: 1,
      zekr: 'بسم الله ، اللهم إني أعوذ بك من الخبث والخبائث',
      type1: 'البخاري 1/45',
      type2: 'الاستعاذة من الشياطين',
    ),

    ZekrModel(
      count: 1,
      zekr: 'غفرانك',
      type1: 'أصحاب السنن',
      type2: 'طلب المغفرة بعد الخروج',
    ),
  ];

  static List<ZekrModel> istikharaAzkar = [
    ZekrModel(
      count: 1,
      zekr: 'اللهم إني أستخيرك بعلمك وأستقدرك بقدرتك وأسألك من فضلك العظيم...',
      type1: 'البخاري 7/162',
      type2: 'طلب التوفيق واختيار الخير',
    ),
  ];

  static List<ZekrModel> clothesAzkar = [
    ZekrModel(
      count: 1,
      zekr: 'الحمد لله الذي كساني هذا الثوب ورزقنيه من غير حول مني ولا قوة',
      type1: 'أهل السنن',
      type2: 'غفر له ما تقدم من ذنبه',
    ),

    ZekrModel(
      count: 1,
      zekr: 'اللهم لك الحمد أنت كسوتنيه أسألك من خيره وخير ما صنع له...',
      type1: 'أبو داود والترمذي',
      type2: 'طلب خير الثوب والاستعاذة من شره',
    ),
  ];

  static List<ZekrModel> prayerInsideAzkar = [
    ZekrModel(
      count: 1,
      zekr: 'سبحانك اللهم وبحمدك وتبارك اسمك وتعالى جدك ولا إله غيرك',
      type1: 'أصحاب السنن',
      type2: 'دعاء الاستفتاح',
    ),

    ZekrModel(
      count: 3,
      zekr: 'سبحان ربي العظيم',
      type1: 'أهل السنن',
      type2: 'ذكر الركوع',
    ),

    ZekrModel(
      count: 3,
      zekr: 'سبحان ربي الأعلى',
      type1: 'أهل السنن',
      type2: 'ذكر السجود',
    ),

    ZekrModel(
      count: 1,
      zekr: 'التحيات لله والصلوات والطيبات السلام عليك أيها النبي...',
      type1: 'البخاري ومسلم',
      type2: 'التشهد',
    ),
  ];
}
