Repository: MohamedAshrafMadkour/rifq_app
Catalog: lib/l10n/app_*.arb
Languages: ar

# splashViewTitle
source: Al-Mushaf Al-Sharif
ar: المصحف الشريف

# splashViewSubTitle
source: Recite the Quran with tartil
ar: ﴿ وَرَتِّلِ الْقُرْآنَ تَرْتِيلًا ﴾

# splashViewDesc
source: Surah Al-Muzzammil - Verse 4
ar: سورة المزمل - آية 4

# firstOnBoardingTitle
source: The Holy Quran
ar: القرآن الكريم

# firstOnBoardingSubTitle
source: Read the Quran clearly with beautiful design and listen to recitations
ar: اقرأ القرآن الكريم بخط واضح وتصميم جميل مع إمكانية الاستماع للتلاوات

# secondOnBoardingTitle
source: Prayer Times
ar: مواقيت الصلاة

# secondOnBoardingSubTitle
source: Accurate notifications for prayer times according to your location with Adhan sound
ar: تنبيهات دقيقة لمواقيت الصلاة حسب موقعك مع صوت الأذان

# thirdOnBoardingTitle
source: Your Spiritual Companion
ar: رفيقك الروحاني

# thirdOnBoardingSubTitle
source: Daily reminders, Azkar, Tasbeeh, everything you need in your spiritual journey
ar: تذكيرات يومية، أذكار، تسبيح، وكل ما تحتاجه في رحلتك الإيمانية

# skipText
source: Skip
ar: تخطي

# onBoardingButtonbuttonText
source: Continue
ar: متابعة

# languageSelectionTitle
source: Choose Language
ar: اختر اللغة

# firstLanguage
source: Arabic
ar: العربية

# secondLanguage
source: English
ar: الانجليزية

# thirdLanguage
source: Urdu
ar: اردو

# fourthLanguage
source: French
ar: فرنسية

# identifyLocationTitle
source: Location
ar: تحديد الموقع

# identifyLocationSubTitle
source: We need your location to calculate accurate prayer times
ar: نحتاج إلى موقعك لحساب أوقات الصلاة الدقيقة في منطقتك وإظهار المساجد القريبة منك

# firstLocationListTile
source: Find Qibla Direction
ar: تحديد اتجاه القبلة

# firstLocationListTileSubTitle
source: We use your location to accurately determine the direction of the Kaaba wherever you are
ar: نستخدم موقعك لتحديد اتجاه الكعبة بدقة أينما كنت

# secondLocationListTile
source: Detect Your Location
ar: تحديد موقعك

# secondLocationListTileSubTitle
source: Your location is required to improve your in-app experience
ar: نحتاج إلى موقعك لتحسين تجربة الاستخدام داخل التطبيق

# thirdLocationListTile
source: Your Privacy Matters
ar: خصوصيتك أولاً

# thirdLocationListTileSubTitle
source: Your location data is never stored or shared with anyone
ar: لا يتم تخزين أو مشاركة بيانات موقعك مع أي جهة

# selectionLocationSetting
source: You can change this later in settings
ar: يمكنك تغيير هذا الإعداد لاحقًا من الإعدادات

# selectionLocationButtonText
source: Allow location access
ar: السماح بصلاحيات الموقع

# locationServicesDisabled
source: Location services are disabled.
ar: خدمات الموقع معطلة.

# locationPermissionsDenied
source: Location permission denied.
ar: صلاحيات الموقع مرفوضة.

# locationPermissionsDeniedForever
source: Location permission denied permanently.
ar: صلاحيات الموقع مرفوضة بشكل دائم، لا يمكن طلبها.

source: Failed to get current location.
ar: فشل الحصول على الموقع الحالي.
